# AddVoltageType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..AddVoltageType Method
ElectricalSetting Class See Also
---
Add a new type definition of voltage into project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public VoltageType AddVoltageType(
	string name,
	double actualValue,
	double minValue,
	double maxValue
)
```

Visual Basic
---
```text
Public Function AddVoltageType ( _
	name As String, _
	actualValue As Double, _
	minValue As Double, _
	maxValue As Double _
) As VoltageType
```

Visual C++
---
```text
public:
VoltageType^ AddVoltageType(
	String^ name,
	double actualValue,
	double minValue,
	double maxValue
)
```

# ### Parameters
name
    Type: System..::..StringSpecify voltage type name
actualValue
    Type: System..::..DoubleSpecify actual value of voltage type.
minValue
    Type: System..::..DoubleSpecify acceptable minimum value of the voltage type.
maxValue
    Type: System..::..DoubleSpecify acceptable maximum value of the voltage type.
# ### Return Value
New added voltage type object.
# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace